Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: wipe
es_419: FRUS

source: boom
es_419: CHAN

source: you’re too kind!
es_419: ¡Eres muy amable!

source: what the hell is that thing?
es_419: ¿Qué diablos es esa cosa?

source: glug
es_419: GLU

source: step
es_419: TAF

source: hidden skill voracity
es_419: Habilidad oculta Voracidad

source: remaining ability points
es_419: Puntos de habilidad restantes:

source: I was fighting a boss too. damn it!
es_419: Estaba luchando contra un jefe. ¡Maldición!

source: thud
es_419: PUM

source: go away.
es_419: Vete.

source: I suddenly saw a huge flash before my eyes...
es_419: De repente vi un destello delante de mis ojos…

source: you ate up an entire village in one go!
es_419: ¡Devoraste a toda una aldea de una sola vez!

source: are you trying to say that you didn’t use your full potential just now?
es_419: ¿Insinúas que no usaste todo tu poder hace un momento?

source: ...to join my party?
es_419: … unirte a mi grupo?

source: it’s just you and me here.
es_419: Solo estamos tú y yo.

source: hahahahahahaha!
es_419: ¡Ja, ja, ja, ja, ja, ja, ja!

source: you are now enemies with the god of classes.
es_419: Te has enemistado con el Dios de las Clases.

source: I lead the ascended.
es_419: Yo guío a los ascendidos.

source: dude, even I know that.
es_419: Viejo, hasta yo sé eso.

source: ring
es_419: RIN

source: I never intended on hiding in the first place.
es_419: Nunca tuve la intención de esconderme.

source: my master shall have his revenge!
es_419: ¡Mi amo tendrá su venganza!

source: for the first time in gaming history...
es_419: Por primera vez en la historia de los juegos…

source: w-wait!
es_419: ¡E-espere!

source: pfft!
es_419: ¡Pfff!

source: huh?
es_419: ¿Eh?

source: aghhhhh!
es_419: ¡Aaaaagh!

source: I feel an ominous, yet familiar energy coming from here.
es_419: Siento una energía inquietante, pero familiar, que sale de aquí.

source: I thought you were on the same team.
es_419: Pensé que estaban en el mismo equipo.

source: lv.{j}999
es_419: Nv. 999

source: tremble
es_419: TIEMBLA

source: ding
es_419: PLIN

source: ...for 14 weeks straight!
es_419: … ¡en el primer puesto!

source: she’s using her bare hands.
es_419: No tiene ningún arma.

source: reinforcement successful!
es_419: ¡Mejora exitosa!

source: that was just the prologue.
es_419: Eso fue solo el prólogo.

source: they’re all pretty cool.
es_419: Todas se ven muy bien.

source: flash
es_419: FIUSH

source: so she has no idea how strong I am?
es_419: Entonces, ¿no tiene idea de lo fuerte que soy?

source: sir, I have bad news!
es_419: ¡Señor, tengo malas noticias!

source: chrono life has gone overboard with this concept.
es_419: Chrono Life se excedió con este concepto.

source: flick
es_419: FLIC

source: starting today, the hallasan guild is over.
es_419: A partir de ahora, el Gremio de Hallasan no existe más.

source: this character has been deleted.
es_419: Este personaje ha sido eliminado.

source: just run away, guys!
es_419: ¡Corran, muchachos!

source: in real life, I’m a nobody.
es_419: En la vida real, soy un don nadie.

source: there’s no more time to waste.
es_419: No hay más tiempo que perder.

source: crack
es_419: CRAC

source: and of course, their ultimate goal was...
es_419: Obviamente, su objetivo final era…

source: or well, they were going well.
es_419: O más bien, iban bien.

source: dang, that kinda hurt.
es_419: Cielos, eso dolió.

source: he’s a murderer who massacred a ton of players!
es_419: ¡Es un asesino que mató a muchísimos jugadores!

source: hahahahaha.
es_419: Ja, ja, ja, ja.

source: ?????? rank 2 of the hallasan guild’s four guardians spent 1.7 billion won
es_419: ¿¿¿??? Rango 2 de los cuatro guardianes del Gremio de Hallasan Gastó 1700 millones de wones

source: ...the poor child reached her limits soon enough.
es_419: … la pobre niña llegó pronto a su límite.

source: stab
es_419: CHUC

source: heh.
es_419: Je.

source: whoa.
es_419: Guau.

source: however...
es_419: Pero…

source: those guys don’t know anything about the items in this game!
es_419: ¡No saben nada de los objetos de este juego!

source: welcome to stage, sarang han!
es_419: ¡Bienvenida al escenario, Sarang Han!

source: I thought the village was a safe zone!
es_419: ¡Pensé que esta aldea era una zona segura!

source: I wanted to tell you eventually, but I couldn’t find the right time to.
es_419: Con el tiempo, te lo iba a decir, pero no encontré el momento adecuado.

source: a-are you not going to kill me?
es_419: ¿N-no vas a matarme?

source: 21{j}loser.
es_419: Perdeodor.

source: oh, f*ck.
es_419: Ay, c*rajo.

source: clang
es_419: CLANC

source: ...I can only use it three more times?
es_419: … ¿solo puedo usarlo tres veces más?

source: then you’ll only be left with those undi--
es_419: Y ya solo te quedarán esos cal…

source: bullshit.
es_419: Qué estupidez.

source: crackle
es_419: CRAAC

source: did I not tell you?
es_419: ¿No te lo dije?

source: live now
es_419: EN VIVO AHORA

source: I can just continue to make more with my mirror of clones.
es_419: Puedo seguir haciendo más con mi espejo de clones.

source: not to mention, the bounty is ten billion gold! that’s equal to ten billion won in real life!
es_419: ¡Además, la recompensa es de diez mil millones en oro! ¡Lo que equivale a diez mil millones de wones en la vida real!

source: I guess urus was right about you two being the same kind. you’re both weak losers!
es_419: Supongo que Urus tenía razón en que son del mismo tipo. ¡Ambos son unos perdedores patéticos!

source: 3,890 viewers
es_419: 3890 espectadores

source: what even is my life?
es_419: ¿Por qué me pasa esto?

source: then there was the time he took down the bunnybear in one hit.
es_419: Y esa vez que derribó a un osonejo de un solo golpe.

source: hey, tentacle dude.
es_419: Oye, tentáculo.

source: it looks like she’s got an online boyfriend in that game.
es_419: Parece que tiene un novio virtual en ese juego.

source: what a load of bull.
es_419: Qué montón de tonterías.

source: hmm, good question.
es_419: Mmm, buena pregunta.

source: live
es_419: EN VIVO

source: why’d you do that?
es_419: ¿Por qué hiciste eso?

source: StoryㆍHONGSIL
es_419: Historia: Hongsil

source: thump
es_419: PUM

source: let’s see how much you’ve practiced.
es_419: Veamos qué tanto practicaste.

source: p-please...
es_419: P-por favor…

source: swoosh
es_419: SUUISH

source: what’s with chrono life?
es_419: ¿Qué le pasa a Chrono Life?

source: anyway...
es_419: En fin…

source: I forgot luv still thinks I’m weak!
es_419: ¡Olvidé que Amor aún piensa que soy débil!

source: what the hell is this?{j}I’m ready to quit tbh.
es_419: ¡¿Qué diablos es esto?! Voy a abandonar el juego.

source: clench
es_419: FURIA

source: we are currently undergoing emergency server maintenance.
es_419: Actualmente estamos haciendo un mantenimiento de emergencia.

source: what an interesting way to go about things.
es_419: Qué manera tan interesante de hacer las cosas.

source: ...saintly!
es_419: ¡Es Santa!

source: stop asking questions and just die.
es_419: Deja de hacer preguntas y muere de una vez.

source: did you wear your glasses while playing that game again?!
es_419: ¡¿Otra vez te dejaste los lentes mientras jugabas?!

source: ahem!
es_419: ¡Ejem!

source: me?
es_419: ¿Yo?

source: vroom
es_419: BRUUM

source: Planning / Production
es_419: Planificación/Producción

source: b...{j}boss...?
es_419: Je… ¿Jefe?

source: that’s right!
es_419: ¡Eso es!

source: and that strength made all the difference between f2p users and p2w users.
es_419: Y eso diferenciaba a los que jugaban gratis de los que pagaban.

source: see more
es_419: Ver más

source: droop
es_419: CABIZBAJO

source: r-red cloaks with white crosses?!
es_419: ¡¿Capas rojas con cruces blancas?!

source: I’m distributing my ability points!
es_419: ¡Estoy distribuyendo mis puntos de habilidad!

source: beep
es_419: BIIP

source: trying not to kill them in one swing, huh?
es_419: ¿Intentas no matarlos de un golpe, eh?

source: tomorrow at 7:30 pm!
es_419: ¡Mañana a las 19:30!

source: remember the "mirror of reflection" skill from earlier?
es_419: ¿Recuerda el “Espejo de refracción” de antes?

source: artㆍJIPERY
es_419: Arte: Jipery

source: heh...
es_419: Je…

source: you’d either end up getting caught in the explosion, or get flung all the way into space.
es_419: O te mata la explosión o terminarás flotando en el espacio.

source: now you’re just making me sad.
es_419: Eso sí que me pone triste.

source: a{j}h{j}h{j}h{j}a{j}h{j}h{j}h
es_419: Aaah

source: what’s he doing there?{j}w
es_419: ¿Qué está haciendo?

source: damn this game!
es_419: ¡Odio este juego!

source: story: hongsil, art: jiperi, producer: du-yeop, staff: jaehyeon lee, rokri, mimanga, kongsna, wallabi
es_419: Arte: Jipery

source: grin
es_419: SONRÍE

source: undies, undies!
es_419: ¡Calzón! ¡Calzón!

source: he’s definitely a bugged character or just using a hack.
es_419: Seguro tiene un personaje fallado o está usando un hack.

source: did he just call me...
es_419: ¿Dijo que soy…

source: how does this even statistically make sense?
es_419: ¿Cómo es posible estadísticamente?

source: flicker
es_419: CHISPA

source: I really spending time at home alone.
es_419: Me gusta mucho pasar tiempo sola en casa.

source: w-we’re getting bombarded with complaints from the users!
es_419: ¡N-nos están bombardeando las quejas de los usuarios!

source: more importantly, what are you going to do about this?
es_419: Lo importante es… ¿qué va a hacer al respecto?

source: now can you get your foot out of my mouth?
es_419: ¿Podrías sacar tu pie de mi boca?

source: what’s wrong with playing games?!
es_419: ¡¿Qué tiene de malo jugar?!

source: we encountered each other today for good reason.
es_419: Nos encontramos aquí por una buena razón.

source: you have absorbed the target’s stats.
es_419: Has absorbido los atributos de tu enemigo.

source: wisp
es_419: FUIP

source: come at me!
es_419: ¡Vengan por mí!

source: aghhhh
es_419: Aaaagh

source: heyyyy!
es_419: ¡Oyeeee!

source: c-come on...
es_419: V-Vamos…

source: I just have my undies and my cape.
es_419: Solo tengo mis calzoncillos y mi capa.

source: skill
es_419: Habilidad

source: what the hell is that?
es_419: ¡¿Qué rayos es eso?!

source: ugh!
es_419: ¡Agh!

source: trudge
es_419: CABIZBAJO

source: I’m pretending to be weak.
es_419: Finjo ser débil.

source: hahahaha!
es_419: ¡Ja, ja, ja, ja, ja!

source: now that you have reached the master level...
es_419: Ahora que has alcanzado el nivel maestro…

source: f{j}w{j}o{j}o{j}s{j}h{j}!
es_419: FUUOOSH

source: they refused to accept that sarang wanted to quit singing.
es_419: Se rehusaron a aceptar que Sarang ya no quisiera cantar.

source: what’s that thing talking about?
es_419: ¿De qué habla esa cosa?

source: I told you to take off your glasses while you play because it leaves that indent on your nose!
es_419: ¡Te dije que te los quitaras cuando juegas porque te dejan marcada la nariz!

source: revenge!
es_419: ¡Venganza!

source: wow!
es_419: ¡Guau!

source: I suddenly feel like a celebrity!
es_419: ¡De repente me siento una celebridad!

source: after using "swing up" just twice...
es_419: Usé el “golpe hacia arriba” dos veces…

source: ...package...?
es_419: … de 55 000 wones?

source: click
es_419: CLIC

source: snap
es_419: CHAS

source: have you ever heard of [old linnagers]?
es_419: ¿Oíste hablar alguna vez de [los viejos Linnagers]?

source: feedback forum
es_419: Foro de comentarios

source: however, their appearance will be flipped horizontally.
es_419: Pero su apariencia estará invertida horizontalmente.

source: supreme commander of the world guild alliance hawkeye
es_419: Hawkeye, comandante supremo de la alianza mundial de gremios

source: scratch
es_419: FRAS

source: how could you reveal your identity to all of those people?!
es_419: ¡¿Cómo pudiste revelar tu identidad ante todas esas personas?!

source: ...in the entertainment industry.
es_419: … en la industria del entretenimiento.

source: designer clothes,
es_419: ropa de diseñador,

source: clack
es_419: CLAC

source: so it’s only logical that we run away.
es_419: Así que lo más lógico era salir corriendo.

source: ...the controversy ended, with nothing but doubts left behind in everyone’s minds.
es_419: … como terminó la polémica, dejando más dudas que certezas en la mente de todos.

source: fifth mirror mirror of reflection
es_419: Quinto espejo Espejo de refracción

source: do you really think I actually gave birth to that?
es_419: ¿En verdad crees que di a luz a una cosa así?

source: I wonder what kind of guy he is.
es_419: Me pregunto qué clase de chico será.

source: a monster that deletes characters?!
es_419: ¡¿Un monstruo que borra personajes?!

source: absorption failed!
es_419: ¡La absorción ha fallado!

source: oh, fairy tales?
es_419: ¿Cuentos de hadas?

source: turn
es_419: ZIS

source: I don’t think you need to worry.
es_419: No creo que deba preocuparse.

source: whoosh
es_419: FUUUSH

source: hold on.
es_419: ¡Espera!

source: guide of the ascended
es_419: Guía de los Ascendidos

source: answer my call!
es_419: ¡Vengan a mí!

source: no one is allowed to own me besides this human right here.
es_419: Nadie está autorizado a ser mi dueño más que este humano de aquí.

source: trying not to kill them in one swing, huh?{j}trying not to kill them in one swing, huh?
es_419: ¿Intentas no matarlos de un golpe, eh?

source: what’s that?
es_419: ¿Qué es eso?

source: it’s the leader of the thieves...
es_419: Es el líder de los ladrones…

source: giant serpent of the snowy fields ellerose lv.{j}190 field boss
es_419: Serpiente gigante de los campos nevados ELLEROSE Nv. 190 Jefe

source: why do you think that is?
es_419: ¿Por qué creen que es eso?

source: hum~♬
es_419: Tarará

source: ...that’s right.
es_419: Así es.

source: glance
es_419: MIRA

source: mr. wang (9 years old)
es_419: Sr. Wang (a los 9 años)

source: quiver
es_419: TIEMBLA

source: "beginner"?
es_419: ¿"Principiante"?

source: these people are used to spending billions. why are they after something that’s only worth a few million?
es_419: Esa gente está acostumbrada a gastar miles de millones. ¿Por qué estarían detrás de algo que vale solo unos millones?

source: once you’ve reached a reinforcement level of +10, the official success rate for the next reinforcement level is 3%.
es_419: Una vez que llegas al nivel +10 de mejora, las probabilidades de que tengas éxito en el siguiente nivel son del 3 %.

source: finished?
es_419: ¿Acabar?

source: +99 wooden stick
es_419: Palo de madera +99

source: you’re scaring him. hehe.
es_419: Lo estás asustando. Je, je.

source: the soul of the [club] has entered your body.
es_419: El alma de [el garrote] ha entrado en tu cuerpo.

source: [hidden skill] all requirements met!
es_419: [Habilidad secreta] ¡Cumples todos los requisitos!

source: spent 12 billion won
es_419: Gastó 12 000 millones de wones

source: front village.
es_419: La aldea Front.

source: aww, I’m so glad to hear that!
es_419: ¡Ay, me alegra mucho oír eso!

source: they aren’t bound to my character, are they?
es_419: No quedarán vinculadas a mi personaje, ¿no?

source: notice
es_419: AVISO

source: so if it has a durability of five and I struck with it twice, that means...
es_419: Su durabilidad es de cinco y ya lo usé dos veces, así que…

source: le{j}it’s so far away that I can’t see...
es_419: Está muy lejos y no se ve bien…

source: I’m...
es_419: Soy…

source: thump{j}h{j}!
es_419: PLOM

source: and that’s how...
es_419: Y así fue…

source: is she a fighter too?
es_419: ¿Es una luchadora también?

source: rustle
es_419: FRUS

source: how to submit feedback
es_419: Cómo enviar comentarios

source: the orb of calling
es_419: Orbe de invocación

source: why’d you have to go and steal other peoples’ weapons, huh?
es_419: ¿Por qué tenían que robar las armas de otros, eh?

source: let go of me, fatty.
es_419: Suéltame, gordito.

source: 800,000 users, huh?
es_419: ¿Así que 800 000 usuarios?

source: wh-what is all of this?!
es_419: ¡¿Q-qué es todo esto?!

source: wh-what’s going on?
es_419: ¿Qué… está pasando?

source: and why was I knocked out just now?
es_419: ¿Y por qué quedé inconsciente antes?

source: my
es_419: de

source: what a predicament.
es_419: Qué dilema.

source: nope.
es_419: Nop.

source: did you just sa--
es_419: ¿Cómo me has llam…?

source: s-sir?
es_419: ¿S-señor?

source: one love
es_419: Un amor

source: tap
es_419: TAC

source: is it another one of your little birds?
es_419: ¿Es otro de esos pajaritos?

source: it is time for you to fall to unbearable des
es_419: Es hora de que caigas en la desesperación ab…

source: why are you so lat--
es_419: ¿Por qué llegas tan tar…?

source: t-ten million gold?!
es_419: ¡¿D-diez millones?!

source: tell me everything.
es_419: Cuéntame todo.

source: mmph!
es_419: ¡Jum!

source: what did I say?
es_419: ¿Qué te dije?

source: if that’s the case, I wouldn’t be able to sell them.
es_419: Si es así, no podré venderlas.

source: gulp
es_419: GLU

source: who even are you?
es_419: ¿Quién eres?

source: grr...
es_419: Grrr…

source: ooh, thanks.
es_419: Ah, gracias.

source: ew, his face lmao{j}cl
es_419: Aj, miren su cara, LOL

source: "satisfaction"?
es_419: ¿”Capricho”?

source: how much...?
es_419: ¿Cuánto…?

source: h-huh?
es_419: ¿E-Eh?

source: when she debuted, she shined brighter than any star in the sky.
es_419: En su debut, brilló más que cualquier estrella del firmamento.

source: ...it was urakan’s body that got ended up getting absorbed in reverse, thanks to healing factor.
es_419: … fue el cuerpo de Urakan el que terminó siendo absorbido, gracias al factor de curación.

source: so how about taking a step back from all the smashing and destroying...
es_419: Entonces, ¿qué te parece si dejas de romper y destruir…

source: did you not hear me?
es_419: ¿No me escuchaste?

source: we applaud you for all of your efforts, young man!
es_419: ¡Te aplaudimos por todos tus esfuerzos, jovencito!

source: sir! are you all right?!
es_419: ¡Señor! ¡¿Está bien?!

source: ten billion gold?
es_419: ¿Diez mil millones?

source: humans may be weak on their own, but they can be a handful when they’re grouped up like this!
es_419: Los humanos serán débiles por sí solos, pero ¡pueden ser todo un problema si se unen así!

source: artㆍJIPERY{j}story: hongsil, art: jipery, producer: yopy, staff: jaehyun lee, rock lee, bobaccari, kongsuna, wallaby, balkwang beoseot
es_419: Arte: Jipery{j}

source: what... happened?
es_419: ¿Qué… pasó?

source: why are they so dead set on taking that weapon from you?
es_419: ¿Por qué están tan obsesionados con quitarte esas manoplas?

source: r{j}o{j}a{j}a{j}a{j}r{j}!
es_419: GRAAAA

source: I’m going to need to stay over for the time being.
es_419: voy a tener que quedarme aquí un tiempo.

source: you go and get ready too, then!
es_419: ¡Tú también ve a cambiarte!

source: please come join our guild!
es_419: ¡Por favor, únete a nuestro gremio!

source: this is my son.
es_419: Este es mi hijo.

source: I am the lost head of urus!
es_419: ¡Soy la cabeza perdida de Urus!

source: lift
es_419: SE LEVANTA

source: eww...
es_419: Ajj…

source: oh, uhh... yes, sir.
es_419: Ah, eh… sí, señor.

source: and where do you think you’re going?
es_419: ¿Y adónde creen que van?

source: and bopping them on the head!
es_419: … saludaba así y así!

source: come on!{j}wn
es_419: ¡Vamos!

source: strike without killing...
es_419: Golpear sin matar…

source: so this is what I’ve decided.
es_419: Así que esto es lo que decidí.

source: g{j}a{j}h{j}h{j}h
es_419: ¡Aaaah!

source: kyaaaaa!
es_419: ¡Aaaaah!

source: what the hell?!
es_419: ¡¿Qué demonios?!

source: w-whoa! it’s coming!
es_419: ¡U-Uooo! ¡Ahí viene!

source: mutter
es_419: MASCULLA

source: what the hell is this?!
es_419: ¡¿Qué rayos es esto?!

source: hey, mister!
es_419: ¡Hola, señor!

source: oh! a wild bunnybear has appeared!
es_419: ¡Ah! ¡Un osonejo salvaje apareció!

source: in this game...
es_419: En este juego…

source: do you know bill gates?
es_419: ¿conocen a Bill Gates?

source: "luv"?
es_419: ¿”Amor”?

source: en_US
es_419: ES_LATAM

source: h-hold on.
es_419: ¡E-esperen!

source: man, I’ve been getting dragged around against my will left and right in this game.
es_419: Cielos, me han llevado contra mi voluntad de un lado para el otro en este juego.

source: aside from mr. kim and his minions...
es_419: Salvo por el Sr. Kim y sus secuaces…

source: I’d look like a noob, but secretly have these wild powers.
es_419: Me veré como un novato, pero en secreto seré muy poderoso.

source: this game sucks!
es_419: ¡Este juego apesta!

source: if I’m going to eliminate the humans...
es_419: Si voy a eliminar a todos los humanos…

source: hahahaha
es_419: ¡Ja, ja, ja, ja, ja!

source: the supreme commander of the world guild alliance.
es_419: … el comandante supremo de la alianza mundial de gremios.

source: munch
es_419: ÑOM

source: you’ve got one hour, undies!
es_419: ¡Te doy una hora, Calzón!

source: hmm...
es_419: Mmm…

source: I don’t know, dude.
es_419: No lo sé, viejo.

source: damn you, undies...
es_419: Maldito seas, Calzón…

source: shut it.
es_419: Cállate.

source: that’s right.
es_419: Así es.

source: online gaming.
es_419: … los juegos en línea.

source: rank: ego durability: ∞
es_419: Ranking: Ego Durabilidad: ∞

source: you actually noticed!
es_419: ¡Te diste cuenta!

source: summon as many people of your choosing to your current location.
es_419: Invoca a cuantas personas quieras a tu ubicación actual.

source: yeah, I’ve definitely seen that face somewhere.
es_419: Sí, definitivamente he visto esa cara en algún lado.

source: create an exact copy of the target.
es_419: Crea una copia exacta de tu objetivo.

source: nice shot!
es_419: ¡Buen golpe!

source: you said you only got the beginner’s package, right?
es_419: Dijiste que solo compraste el paquete de principiante, ¿no?

source: secretly op persona mode <off>
es_419: Modo de Imagen SP secreta <desactivado>

source: looks like the servers really are down.
es_419: Parece que sí se cayeron los servidores.

source: wait a minute.
es_419: Un momento.

source: no problem!
es_419: ¡No hay problema!

source: wait...
es_419: Un momento…

source: we would like to apologize for interrupting your gameplay.
es_419: Queremos disculparnos por interrumpir su juego.

source: ?????? rank 3 of the hallasan guild’s four guardians spent 1.4 billion won
es_419: ¿¿¿??? Rango 3 de los cuatro guardianes del Gremio de Hallasan Gastó 1400 millones de wones

source: cut it out.
es_419: Ya basta.

source: float
es_419: FUUSH

source: if you want to get stronger faster, you need to fight too!
es_419: Si quieres volverte fuerte más rápido, ¡tienes que pelear!

source: eek...
es_419: Aaj…

source: and get your dirty foot off of that ribbon.
es_419: Y quita tu pie inmundo de esa cinta.

source: it doesn’t really matter if these skills are balanced or not.
es_419: realmente no importa si estas habilidades están equilibradas o no.

source: Producerㆍyopy
es_419: Producción: Yopy

source: point
es_419: SEÑALA

source: how interesting.
es_419: Qué interesante.

source: if bill gates makes 150 dollars per second...
es_419: Si Bill Gates gana 150 dólares por segundo…

source: after looking into it...
es_419: Después de investigar…

source: welcome, sarang han.
es_419: Bienvenida, Sarang Han.

source: the [weapons of the ascended] will be moved to the subspace.
es_419: Las [armas de los Ascendidos] serán trasladadas al subespacio.

source: this is why you can’t help out noobs!
es_419: ¡Por eso no hay que ayudar a los nuevos!

source: my master shall have his revenge!{j}r{j}r{j}r
es_419: ¡Mi amo tendrá su venganza!
